Revit 2027 API
ScheduleDefinition.SetFieldOrder Method
 Reorders the fields in the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFieldOrder(
	IList<ScheduleFieldId> fieldIds
)
Public Sub SetFieldOrder (
	fieldIds As IList(Of ScheduleFieldId)
)
public:
void SetFieldOrder(
	IList<ScheduleFieldId^>^ fieldIds
)
member SetFieldOrder :
        fieldIds : IList<ScheduleFieldId> -> unit
Parameters
fieldIds IList<ScheduleFieldId>
 The field IDs in a new order.
Exceptions
Exception | Condition
ArgumentException |  fieldIds does not contain exactly the same field IDs as this ScheduleDefinition currently contains.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace